{
  "backend/main.mo": "Motoko canister implementing user profiles, question/answer handling, and authorization checks for user and admin actions.",
  "feature_evidence.json": "Feature evidence report linking product features to corresponding frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their roles in styling, routing, hooks, components, and music features.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables, dark mode values, and global background/border styles.",
  "frontend/index.html": "HTML entry point with root mount node and script loading the React application.",
  "frontend/src/App.tsx": "Main React app component handling authentication, profile setup, hash routing, and page rendering within AppLayout.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity flow with loading states and React Query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting new users for a display name and saving the profile via mutation.",
  "frontend/src/components/layout/AppLayout.tsx": "App-wide layout with NavBar, footer, and wiring for background music controls passed into navigation.",
  "frontend/src/components/layout/NavBar.tsx": "Navigation bar component with route links, branding, and optional background music controls via a popover.",
  "frontend/src/components/moderation/AddAnswerForm.tsx": "Form for moderators to submit compassionate answers with validation, character count, and mutation to save responses.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Hook that manages background audio playback, volume persistence, and error handling using an audio element.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login flow, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor calls for profiles, questions, answers, roles, and guidance text.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables with warm palette tones and global styles.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client provider, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections describing the platform’s values and how it works using cards and icons.",
  "frontend/src/pages/AskPage.tsx": "Provides a form for users to submit questions with validation, anonymous posting, and guidance text.",
  "frontend/src/pages/HomePage.tsx": "Displays a hero section, important notice, and a sorted list of recent questions fetched from the backend.",
  "frontend/src/pages/LoginPage.tsx": "Shows a branded login screen and triggers Internet Identity authentication.",
  "frontend/src/pages/QuestionDetailPage.tsx": "Fetches and displays detailed question info, metadata, and answers, with admin support for adding responses.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, versioning, and a list of existing feature specifications for the Ask Big Sister app."
}