{
  "backend/main.mo": "Motoko canister implementing user profiles, question submission, and admin-only answering with access control and validation.",
  "feature_evidence.json": "Machine-readable report mapping features to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of key frontend files including pages, hooks, components, and assets.",
  "frontend/index.css": "Base Tailwind setup defining OKLCH color tokens for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "Root HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Top-level React component handling Internet Identity auth, profile gating, hash routing, and layout rendering.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button managing Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new users for a display name and saving their profile with validation and pending states.",
  "frontend/src/components/layout/AppLayout.tsx": "Shared layout with NavBar, footer, and background music control wiring for play, pause, volume, and error states.",
  "frontend/src/components/layout/NavBar.tsx": "A navigation bar component with route links, branding, and optional background music controls using popovers and volume/play interactions.",
  "frontend/src/components/moderation/AddAnswerForm.tsx": "A moderator form that submits an answer to a question with validation, character counting, and mutation handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useBackgroundMusic.ts": "Manages background audio playback with autoplay attempts, volume control, error handling, and persistence in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity login, stored identities, and authentication state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, questions, roles, and answers through the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light and dark themes, plus global styles for borders and body typography.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing the platform’s purpose and values using cards and icons.",
  "frontend/src/pages/AskPage.tsx": "Provides a form for submitting new questions with validation, optional anonymity, and guidance text display.",
  "frontend/src/pages/HomePage.tsx": "Displays a hero section, an important notice, and a sorted list of recent questions with loading handling.",
  "frontend/src/pages/LoginPage.tsx": "Shows a branded login screen with feature highlights and triggers Internet Identity login.",
  "frontend/src/pages/QuestionDetailPage.tsx": "Fetches and displays a single question with metadata, answer details, and admin moderation options.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash), persist them in sessionStorage, and clear them from URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugin integrations.",
  "project_state.json": "Defines project metadata, existing features, and pending feature requests for the Ask Big Sister project."
}