{
  "backend/main.mo": "Motoko canister managing user profiles, question submission with validation, and admin-only answering using access control.",
  "feature_evidence.json": "Feature-evidence mapping listing app features, associated files, components, and test IDs for requirements tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file and component.",
  "frontend/index.css": "Tailwind base theme defining warm OKLCH color variables, dark mode values, and global border/body styles.",
  "frontend/index.html": "HTML shell providing root div and loading main React entry point.",
  "frontend/src/App.tsx": "Main app logic handling authentication, hash routing, profile setup gating, and page rendering inside the layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading states and cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting new users for a display name and saving their profile via backend mutation.",
  "frontend/src/components/layout/AppLayout.tsx": "App layout wrapper with navigation, page container, and footer attribution.",
  "frontend/src/components/layout/NavBar.tsx": "Responsive top navigation bar with app branding, route links, and login button.",
  "frontend/src/components/moderation/AddAnswerForm.tsx": "Form component allowing moderators to submit compassionate answers, enforcing a 20‑character minimum and using a mutation to send responses.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, loading stored identities, and exposing login and logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating questions, answers, user profiles, and roles using the backend actor.",
  "frontend/src/index.css": "Tailwind setup with custom light and dark theme color variables and base styling for the app.",
  "frontend/src/main.tsx": "App entry point that initializes React, wraps the app with React Query and Internet Identity providers, and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Static About page describing the platform’s purpose, values, and how it works using styled cards and icons.",
  "frontend/src/pages/AskPage.tsx": "Renders a form to submit a new question with anonymity options, validation, and guidance text. Handles question submission and redirects to the new question page.",
  "frontend/src/pages/HomePage.tsx": "Displays a hero section, guidance text, and a sorted list of recent questions with loading and empty states. Links to the ask page and shows question counts.",
  "frontend/src/pages/LoginPage.tsx": "Provides a login screen using Internet Identity with branding, feature highlights, and a login button with loading state.",
  "frontend/src/pages/QuestionDetailPage.tsx": "Shows detailed question info, status, metadata, and the answer if available, with admin features for adding answers. Handles loading and not‑found cases.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, store, persist, and clear URL parameters and session values, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, containers, and theme customizations for the project.",
  "project_state.json": "Defines the current state of the Ask Big Sister app project, including features, pending requests, required images, and project metadata. Lists implemented core features like question submission, moderator answers, privacy options, navigation, and visual theme requirements."
}