{
  "kind": "build_request",
  "title": "Add soothing background music playback",
  "projectName": "Ask Big Sister",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Add a built-in soothing background music track as a static frontend asset and play it in-app using the browser audio API (no backend involvement).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Add some soothing music"
        ]
      },
      "acceptanceCriteria": [
        "A calming audio file is added to the frontend static assets (e.g., under frontend/public/assets/...) and is bundled/served by the app without any backend changes.",
        "Audio playback works in modern browsers and does not rely on any external URLs or streaming services."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Provide user controls to start/stop the soothing music and adjust volume, accessible from the main app UI (e.g., in the top navigation bar) with clear English labels.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Add some soothing music"
        ]
      },
      "acceptanceCriteria": [
        "There is a visible control to Play/Pause the background music and a volume control (slider or equivalent).",
        "Controls are keyboard accessible and have accessible labels (e.g., aria-label).",
        "When music is playing, the UI reflects the playing state; when paused, it reflects the paused state."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Ensure background music respects user expectations and browser policies by defaulting to muted/off until the user explicitly starts playback, and persist the user’s preference (play state + volume) locally in the browser.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Add some soothing music"
        ]
      },
      "acceptanceCriteria": [
        "On first visit (or with no stored preference), music is not playing automatically.",
        "After the user starts music and/or sets volume, the app remembers the settings across page reloads in the same browser (e.g., via localStorage).",
        "If playback fails due to browser restrictions, the app does not crash and provides a non-blocking, user-friendly indication (in English) that the user may need to press Play."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose instead).",
    "Keep the backend as a single Motoko actor; no backend changes are required for music playback."
  ],
  "nonGoals": [
    "Do not add any third-party audio streaming/integrations (e.g., Spotify, YouTube).",
    "Do not implement real-time shared listening or sync between users/sessions.",
    "Do not store music playback preferences in the backend user profile."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}