{
  "kind": "build_request",
  "title": "Autoplay Soft Flute Background Music",
  "projectName": "Ask Big Sister",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Add a soft flute background music track as a static frontend asset and configure the app to use it for background playback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-17"
        ],
        "quotes": [
          "Automatically play soft flute tunes"
        ]
      },
      "acceptanceCriteria": [
        "A flute-based audio file is available under the frontend public assets (e.g., within /assets/audio/) and is referenced by the background music hook.",
        "The background music audio track used by the app is the new soft flute tune (not the previous default track)."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Automatically attempt to start playing the flute background music when the app loads, while handling browser autoplay restrictions gracefully (i.e., if playback is blocked, keep music off and present a clear, English message prompting the user to press Play).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-17"
        ],
        "quotes": [
          "Automatically play soft flute tunes"
        ]
      },
      "acceptanceCriteria": [
        "On initial app load, the app attempts to start background music playback without requiring the user to open the music popover first.",
        "If the browser blocks autoplay, the app does not crash and shows an English message indicating playback was blocked and the user should press Play.",
        "If autoplay succeeds, the music control UI reflects the playing state (e.g., playing indicator is visible)."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Persist the user’s background music preferences locally so that both volume and play state are restored across page reloads.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-17"
        ],
        "quotes": [
          "Automatically play soft flute tunes"
        ]
      },
      "acceptanceCriteria": [
        "Changing volume persists across reloads.",
        "If the user pauses music, it remains paused after reload; if the user leaves it playing and the browser allows autoplay, it resumes after reload.",
        "Persisted preferences use the existing localStorage key (ask-big-sister-music-prefs) and remain backward-compatible with previously stored volume-only data."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only shadcn components).",
    "Do not modify immutable hook files listed in SYSTEM_CONTEXT (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend is not involved in music playback; keep all music logic entirely in the frontend.",
    "Autoplay behavior must respect browser policies by handling blocked playback without breaking the app."
  ],
  "nonGoals": [
    "Add secret chat rooms.",
    "Add real-time chat or WebSocket-based features.",
    "Implement server-side storage of music preferences."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}