{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Autoplay Soft Flute Background Music (Frontend Only)",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Add a soft flute background music track as a static public asset and switch the background music hook to use it.",
      "acceptanceCriteria": [
        "A flute-based audio file is available under the frontend public assets (e.g., within /assets/audio/) and is referenced by the background music hook.",
        "The background music audio track used by the app is the new soft flute tune (not the previous default track)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/audio/soft-flute-background.mp3",
          "operation": "create",
          "description": "Add the new soft flute background music MP3 as a static public asset for the app."
        },
        {
          "path": "frontend/src/hooks/useBackgroundMusic.ts",
          "operation": "modify",
          "description": "Update the audio source path to reference the new static asset at frontend/public/assets/audio/soft-flute-background.mp3 (replacing the previous default track)."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Attempt to autoplay background music on app load and handle autoplay restrictions gracefully with a clear prompt to press Play.",
      "acceptanceCriteria": [
        "On initial app load, the app attempts to start background music playback without requiring the user to open the music popover first.",
        "If the browser blocks autoplay, the app does not crash and shows an English message indicating playback was blocked and the user should press Play.",
        "If autoplay succeeds, the music control UI reflects the playing state (e.g., playing indicator is visible)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackgroundMusic.ts",
          "operation": "modify",
          "description": "Add an initial autoplay attempt when the hook first mounts (guarded to run once) and handle blocked playback by keeping music off, capturing the error, and exposing a clear English message prompting the user to press Play; ensure the hook state updates drive the existing playing indicator when autoplay succeeds."
        },
        {
          "path": "frontend/src/components/layout/NavBar.tsx",
          "operation": "modify",
          "description": "Ensure the autoplay-blocked message is clearly presented to the user (in English) without requiring the popover to be opened (e.g., a small inline notice near the music control when an error exists), while keeping the existing popover message as well."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Persist and restore background music volume and play preference across reloads using the existing localStorage key with backward compatibility.",
      "acceptanceCriteria": [
        "Changing volume persists across reloads.",
        "If the user pauses music, it remains paused after reload; if the user leaves it playing and the browser allows autoplay, it resumes after reload.",
        "Persisted preferences use the existing localStorage key (ask-big-sister-music-prefs) and remain backward-compatible with previously stored volume-only data."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackgroundMusic.ts",
          "operation": "modify",
          "description": "Extend localStorage persistence under the existing key ask-big-sister-music-prefs to include both volume and a stored play preference; on init, read volume-only data safely (backward compatible) and determine whether to attempt autoplay based on stored play preference (defaulting to attempting autoplay when play preference was never stored). Update play/pause actions to persist the play preference accordingly."
        }
      ]
    }
  ]
}