{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add soothing background music playback",
  "requirements": [
    {
      "id": "REQ-7",
      "summary": "Add a built-in soothing background music track as a static frontend asset and play it in-app via the browser Audio API.",
      "acceptanceCriteria": [
        "A calming audio file is added to the frontend static assets (e.g., under frontend/public/assets/...) and is bundled/served by the app without any backend changes.",
        "Audio playback works in modern browsers and does not rely on any external URLs or streaming services."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/audio/soothing-background.mp3",
          "operation": "create",
          "description": "Add a calming, royalty-free background music track as a static asset served by the frontend build."
        },
        {
          "path": "frontend/src/hooks/useBackgroundMusic.ts",
          "operation": "create",
          "description": "Implement a reusable React hook that creates/manages a single HTMLAudioElement for the static asset (frontend/public/assets/audio/soothing-background.mp3) using the browser Audio API (play/pause, volume, and safe lifecycle cleanup)."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add accessible Play/Pause and volume controls in the main UI (top navigation bar) with clear English labels.",
      "acceptanceCriteria": [
        "There is a visible control to Play/Pause the background music and a volume control (slider or equivalent).",
        "Controls are keyboard accessible and have accessible labels (e.g., aria-label).",
        "When music is playing, the UI reflects the playing state; when paused, it reflects the paused state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/NavBar.tsx",
          "operation": "modify",
          "description": "Add a small 'Music' control group in the right-side nav area containing a Play/Pause button and a volume slider (e.g., input[type=range]) with clear English text/labels and appropriate aria-labels; reflect playing vs paused state in the button label and styling."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Wire background-music state/handlers from useBackgroundMusic into NavBar via props so controls are accessible from the main app UI and remain consistent across route changes."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Default music to off until user starts it, persist play state + volume locally, and handle browser playback restrictions gracefully.",
      "acceptanceCriteria": [
        "On first visit (or with no stored preference), music is not playing automatically.",
        "After the user starts music and/or sets volume, the app remembers the settings across page reloads in the same browser (e.g., via localStorage).",
        "If playback fails due to browser restrictions, the app does not crash and provides a non-blocking, user-friendly indication (in English) that the user may need to press Play."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackgroundMusic.ts",
          "operation": "modify",
          "description": "Persist user preference locally (play state + volume) via localStorage; initialize with music off by default when no preference exists; wrap audio.play() calls with error handling to prevent crashes and expose a user-friendly, non-blocking error message when playback is blocked."
        },
        {
          "path": "frontend/src/components/layout/NavBar.tsx",
          "operation": "modify",
          "description": "Display any non-blocking playback status/error text (English) near the music controls (e.g., 'Playback was blocked by your browser. Please press Play.') and ensure UI stays responsive even when playback fails."
        }
      ]
    }
  ]
}